In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({"name":['Alfred', 'Batman', 'Catwoman'],
                   "toy" : [np.nan, 'Batmobile', 'Bullwhip'], 
                   "born" : [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [3]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [4]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [9]:
df.dropna(how = 'all', axis = 1)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [10]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [13]:
df.loc[1, 'born'] = pd.NaT

In [14]:
df

       name        toy born
0    Alfred        NaN  NaT
1    Batman  Batmobile  NaT
2  Catwoman   Bullwhip  NaT

In [20]:
df.dropna(how = 'all', axis = 1)

       name        toy
0    Alfred        NaN
1    Batman  Batmobile
2  Catwoman   Bullwhip

In [21]:
df

       name        toy born
0    Alfred        NaN  NaT
1    Batman  Batmobile  NaT
2  Catwoman   Bullwhip  NaT

In [22]:
df.dropna()

Empty DataFrame
Columns: [name, toy, born]
Index: []

In [23]:
df

       name        toy born
0    Alfred        NaN  NaT
1    Batman  Batmobile  NaT
2  Catwoman   Bullwhip  NaT

In [24]:
df = pd.DataFrame({"name":['Alfred', 'Batman', 'Catwoman'],
                   "toy" : [np.nan, 'Batmobile', 'Bullwhip'], 
                   "born" : [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [25]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [26]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [27]:
df.dropna(how = 'any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [28]:
df.dropna(axis = 1)

       name
0    Alfred
1    Batman
2  Catwoman

In [29]:
df.dropna(axis = 1, how = 'all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [32]:
df = pd.DataFrame({"name":['Alfred', 'Batman', 'Alfred'],
                   "toy" : [np.nan, 'Batmobile', 'Bullwhip'], 
                   "born" : [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [33]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [40]:
df.drop_duplicates(subset = ['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [41]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [43]:
df.shape

(3, 3)

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [46]:
type(df.shape)

tuple

In [49]:
df.value_counts()

name    toy        born
Batman  Batmobile  1940-04-25    1
Name: count, dtype: int64

In [50]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [51]:
df['name'].value_counts()

name
Alfred    2
Batman    1
Name: count, dtype: int64

In [54]:
df['name'].value_counts(dropna = True)

name
Alfred    2
Batman    1
Name: count, dtype: int64

In [55]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [56]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False